# steps.py — финальный по index.js
steps = [
    {"step": 1, "positions": [
        ("Лицом вверх", 1.5),
        ("На животе", 1.5),
        ("Левый бок", 1),
        ("Правый бок", 1),
        ("В тени", 3)
    ]},
    {"step": 2, "positions": [
        ("Лицом вверх", 2),
        ("На животе", 2),
        ("Левый бок", 1),
        ("Правый бок", 1),
        ("В тени", 3)
    ]},
    {"step": 3, "positions": [
        ("Лицом вверх", 3),
        ("На животе", 3),
        ("Левый бок", 1.5),
        ("Правый бок", 1.5),
        ("В тени", 5)
    ]},
    {"step": 4, "positions": [
        ("Лицом вверх", 5),
        ("На животе", 5),
        ("Левый бок", 2.5),
        ("Правый бок", 2.5),
        ("В тени", 5)
    ]},
    {"step": 5, "positions": [
        ("Лицом вверх", 7),
        ("На животе", 7),
        ("Левый бок", 3),
        ("Правый бок", 3),
        ("В тени", 7)
    ]},
    {"step": 6, "positions": [
        ("Лицом вверх", 9),
        ("На животе", 9),
        ("Левый бок", 5),
        ("Правый бок", 5),
        ("В тени", 10)
    ]},
    {"step": 7, "positions": [
        ("Лицом вверх", 12),
        ("На животе", 12),
        ("Левый бок", 7),
        ("Правый бок", 7),
        ("В тени", 10)
    ]},
    {"step": 8, "positions": [
        ("Лицом вверх", 15),
        ("На животе", 15),
        ("Левый бок", 10),
        ("Правый бок", 10),
        ("В тени", 10)
    ]},
    {"step": 9, "positions": [
        ("Лицом вверх", 20),
        ("На животе", 20),
        ("Левый бок", 15),
        ("Правый бок", 15),
        ("В тени", 15)
    ]},
    {"step": 10, "positions": [
        ("Лицом вверх", 25),
        ("На животе", 25),
        ("Левый бок", 20),
        ("Правый бок", 20),
        ("В тени", 20)
    ]},
    {"step": 11, "positions": [
        ("Лицом вверх", 35),
        ("На животе", 35),
        ("Левый бок", 25),
        ("Правый бок", 25),
        ("В тени", 30)
    ]},
    {"step": 12, "positions": [
        ("Лицом вверх", 45),
        ("На животе", 45),
        ("Левый бок", 30),
        ("Правый бок", 30),
        ("В тени", 40)
    ]},
]
